skittleson/mqtt_broker_esp/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM - 8MB octal
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# lwIP - support 100+ concurrent connections
CONFIG_LWIP_MAX_SOCKETS=115
CONFIG_LWIP_MAX_ACTIVE_TCP=115
CONFIG_LWIP_MAX_LISTENING_TCP=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2920
CONFIG_LWIP_TCP_WND_DEFAULT=2920
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32

# WiFi - need SoftAP support for fallback
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# Flash size - 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition table - custom OTA layout
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Log level - INFO for release (set to DEBUG for development)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# Console output via UART0 (GPIO43 TX, GPIO44 RX) AND USB-Serial/JTAG
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Ethernet W5500 (uncomment for boards with W5500 SPI Ethernet)
# When enabled, the ESP32 bridges Ethernet LAN <-> WiFi AP via NAPT.
# CONFIG_MQTT_BROKER_ETHERNET=y
# CONFIG_ETH_USE_SPI_ETHERNET=y
# CONFIG_ETH_SPI_ETHERNET_W5500=y

# NAPT / IP forwarding (required for Ethernet bridging)
# CONFIG_LWIP_IP_FORWARD=y
# CONFIG_LWIP_IPV4_NAPT=y
